[{"author": "HelloFresh",
    "canonical_url": "https://www.hellofresh.com/recipes/balsamic-fig-beef-tenderloin-5f3aeb9bad6a05609c7d8cac",
    "category": "main course",
    "cuisine": "American",
    "host": "hellofresh.com",
    "image": "https://img.hellofresh.com/f_auto,fl_lossy,h_640,q_auto,w_1200/hellofresh_s3/image/5f3aeb9bad6a05609c7d8cac-e04ed433.jpg",
    "ingredients": ["12 ounce Yukon Gold Potatoes", "8 ounce Brussels Sprouts", "1 unit Shallot", "¼ ounce Rosemary", "1 clove Garlic", "2 tablespoon Sour Cream", "¼ cup Panko Breadcrumbs", "10 ounce Beef Tenderloin Steak", "1 unit Beef Stock Concentrate", "2 tablespoon Fig Jam", "5 teaspoon Balsamic Vinegar", "3 tablespoon Butter", "1 tablespoon Olive Oil", "2 teaspoon Vegetable Oil", "Kosher Salt", "Pepper"], 
    "instructions": "• Adjust rack to top position and preheat oven to 425 degrees. Wash and dry all produce. • Dice potatoes into ½-inch pieces. Trim and halve Brussels sprouts lengthwise. Halve, peel, and mince shallot until you have 2 TBSP (3 TBSP for 4 servings). Strip rosemary leaves from stems; mince leaves until you have 1 tsp (2 tsp for 4). Peel and mince or grate garlic.\n• Place potatoes in a medium pot with enough salted water to cover by 2 inches. Bring to a boil and cook until tender, 15-20 minutes. Reserve ½ cup potato cooking liquid; drain. • Melt 2 TBSP butter (4 TBSP for 4 servings) in empty pot over medium heat. Add garlic; cook until fragrant, 30 seconds. Add potatoes and sour cream; mash until smooth, adding splashes of reserved cooking liquid as needed. Season with salt and pepper.\n• While potatoes cook, heat a drizzle of olive oil in a medium, preferably nonstick, pan over medium-high heat. Add panko and season with salt and pepper. Cook, stirring often, until golden brown, 3-5 minutes. Turn off heat; transfer panko to a medium bowl. Wipe out pan.\n• Toss Brussels sprouts on a baking sheet with a large drizzle of olive oil, salt, and pepper. Roast on top rack until browned and crispy, 15-20 minutes. • Add to bowl with toasted panko; toss to combine. Season with half the minced rosemary, salt, and pepper.\n• While Brussels sprouts roast, pat beef* dry with paper towels; season all over with salt and pepper. • Heat a large drizzle of oil in pan used for panko over medium-high heat. Add beef and cook to desired doneness, 4-7 minutes per side. Turn off heat; remove from pan and set aside to rest for at least 5 minutes. Wipe out pan.\n• Melt 1 TBSP butter in same pan over medium heat. Add minced shallot; cook until fragrant, 1-2 minutes. Stir in stock concentrate, jam, vinegar, 2 TBSP water (4 TBSP for 4 servings), any resting juices from beef, and remaining minced rosemary to taste. Cook until slightly thickened, 1-2 minutes. Season with salt and pepper. • Divide potatoes, Brussels sprouts, and beef between plates. Top beef with sauce and serve.", 
    "instructions_list": ["Adjust rack to top position and preheat oven to 425 degrees. Wash and dry all produce. Dice potatoes into -inch pieces. Trim and halve Brussels sprouts lengthwise. Halve, peel, and mince shallot until you have 2 TBSP (3 TBSP for 4 servings). Strip rosemary leaves from stems; mince leaves until you have 1 tsp (2 tsp for 4). Peel and mince or grate garlic.", " Place potatoes in a medium pot with enough salted water to cover by 2 inches. Bring to a boil and cook until tender, 15-20 minutes. Reserve  cup potato cooking liquid; drain.  Melt 2 TBSP butter (4 TBSP for 4 servings) in empty pot over medium heat. Add garlic; cook until fragrant, 30 seconds. Add potatoes and sour cream; mash until smooth, adding splashes of reserved cooking liquid as needed. Season with salt and pepper.", " While potatoes cook, heat a drizzle of olive oil in a medium, preferably nonstick, pan over medium-high heat. Add panko and season with salt and pepper. Cook, stirring often, until golden brown, 3-5 minutes. Turn off heat; transfer panko to a medium bowl. Wipe out pan.", " Toss Brussels sprouts on a baking sheet with a large drizzle of olive oil, salt, and pepper. Roast on top rack until browned and crispy, 15-20 minutes.  Add to bowl with toasted panko; toss to combine. Season with half the minced rosemary, salt, and pepper.", " While Brussels sprouts roast, pat beef* dry with paper towels; season all over with salt and pepper.  Heat a large drizzle of oil in pan used for panko over medium-high heat. Add beef and cook to desired doneness, 4-7 minutes per side. Turn off heat; remove from pan and set aside to rest for at least 5 minutes. Wipe out pan.", " Melt 1 TBSP butter in same pan over medium heat. Add minced shallot; cook until fragrant, 1-2 minutes. Stir in stock concentrate, jam, vinegar, 2 TBSP water (4 TBSP for 4 servings), any resting juices from beef, and remaining minced rosemary to taste. Cook until slightly thickened, 1-2 minutes. Season with salt and pepper.  Divide potatoes, Brussels sprouts, and beef between plates. Top beef with sauce and serve."], 
    "language": "en", 
    "nutrients": ["calories: 750 kcal", "fatContent: 38 g", "saturatedFatContent: 17 g", "carbohydrateContent: 61 g", "sugarContent: 19 g", "proteinContent: 40 g", "fiberContent: 9 g", "cholesterolContent: 145 mg", "sodiumContent: 590 mg"], "site_name": "HelloFresh", 
    "title": "Balsamic & Fig Beef Tenderloin with Garlic Mashed Potatoes & Rosemary Breadcrumb Brussels Sprouts", 
    "total_time": 40, 
    "yields": "2 servings"}
]
